Updated Cap Theorem Notes
